# Пригадування функцій.

# f(x) = x * 2

# def ім'я функції (параметри):
#   код функції.

def f(x):
    return x * 2

result = f(13)

print(result)

# Як передавати число з клавіатури в функцію.

z = f(int(input("Enter Number: ")))
print(z)
    
# Як передати більш ніж один параметр в функцію.

def k(a,b,c):
    return a + b + c

result = k(int(input("Enter Number: ")),int(input("Enter Number: ")),int(input("Enter Number: ")))
print(result)

#-------------------------

def num(x):
    return x * 2

z = num(1)

if z > 5:
    print( str(z) + " Більше 5")
else:
    print( str(z) + " Менше 5")

# ____________________________________________________________

# 1. Зробити функцію max() яка буде приймати 2 числа.
# В середині неї перевірка яке з цих чисел більше, повернути(return) його та
# вивести в консоль.
# ____________________________________________________________

# 2. Зробити функцію len() яка буде приймати 1 речення.
# В середині неї повернути(return) розмір всього речення.

# ____________________________________________________________

# 3. Зробити функцію яка буде приймати 3 числа.
# В середині неї повернути(return) середнє арифметичне чисел.

# ____________________________________________________________

# 4. Зробити функцію яка буде приймати номер місяця.
# В середині повернути(return) назву місяця по номеру.

# ____________________________________________________________